pet_examples/evaluation/model_comp_corr/gpt3/mermaid/activities/3_3.mmd
graph LR
A[Register Claim] --> B[Examine Claim]
B --> C[Write Recommendation]
C --> D[Check Recommendation]
D --> E[Mark Claim]
E --> F[Send Back]
F --> G[Repeat Recommendation]
G --> H[Proceed]
